apache/nuttx/arch/arm/src/max326xx/max32660/max32660_spim.c
/****************************************************************************
 * arch/arm/src/max326xx/max32660/max32660_spim.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * The external functions, max326_spi1/2/3select and max326_spi1/2/3status
 * must be provided by board-specific logic.  They are implementations of
 * the select and status methods of the SPI interface defined by struct
 * spi_ops_s (see include/nuttx/spi/spi.h). All other methods (including
 * max326_spibus_initialize()) are provided by common MAX326 logic.  To use
 * this common SPI logic on your board:
 *
 *   1. Provide logic in max326_boardinitialize() to configure SPI chip
 *      select pins.
 *   2. Provide max326_spi1/2/3select() and max326_spi1/2/3status() functions
 *      in your board-specific logic.  These functions will perform chip
 *      selection and status operations using GPIOs in the way your board is
 *      configured.
 *   3. Add a calls to max326_spibus_initialize() in your low level
 *      application initialization logic
 *   4. The handle returned by max326_spibus_initialize() may then be used
 *      to bind the SPI driver to higher level logic (e.g., calling
 *      mmcsd_spislotinitialize(), for example, will bind the SPI driver to
 *      the SPI MMC/SD driver).
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <assert.h>
#include <errno.h>
#include <debug.h>

#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/mutex.h>
#include <nuttx/spi/spi.h>

#include "arm_internal.h"
#include "chip.h"
#include "hardware/max326_pinmux.h"
#include "max326_clockconfig.h"
#include "max326_periphclks.h"
#include "max326_gpio.h"
#include "max326_dma.h"
#include "max326_spim.h"

#include <arch/board/board.h>

#if defined(CONFIG_MAX326XX_HAVE_SPIM)

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#ifdef CONFIG_MAX326_SPI_DMA
#  error DMA not yet supported
#endif

#ifndef CONFIG_DEBUG_MEMCARD_INFO
#  undef CONFIG_MAX326_SPI_REGDEBUG
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct max326_spidev_s
{
  struct spi_dev_s dev;          /* Externally visible part of the SPI interface */
  const void      *txbuffer;     /* Tx buffer pointer (may be NULL) */
  void            *rxbuffer;     /* Rx buffer pointer (may be NULL) */
  uint32_t         base;         /* SPI base address */
  uint32_t         frequency;    /* Requested clock frequency */
  uint32_t         actual;       /* Actual clock frequency */
  mutex_t          lock;         /* Held while chip is selected for mutual exclusion */
  uint16_t         rxbytes;      /* Number of bytes received into rxbuffer */
  uint16_t         txbytes;      /* Number of bytes sent from txbuffer */
  uint16_t         xfrlen;       /* Transfer length */
  bool             initialized;  /* True: SPI interface been initialized */
  bool             data16;       /* True: 16- vs 8-bit data transfers */
  bool             wire3;        /* True: 3- vs 4-pin mode */
  bool             busy;         /* True: Transfer started */
#ifdef CONFIG_MAX326_SPI_INTERRUPTS
  uint8_t          irq;          /* SPI IRQ number */
#endif
  uint8_t          nbits;        /* Width of word in bits (4 through 16) */
  uint8_t          mode;         /* Mode 0,1,2,3 */

#ifdef CONFIG_MAX326_SPI_REGDEBUG
  /* Debug stuff */

  bool             wrlast;       /* Last was a write */
  uint32_t         addrlast;     /* Last address */
  uint32_t         vallast;      /* Last value */
  int              ntimes;       /* Number of times */
#endif
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Helpers */

#ifdef CONFIG_MAX326_SPI_REGDEBUG
static bool spi_checkreg(struct max326_spidev_s *priv, bool wr,
              uint32_t regval, uintptr_t regaddr);
static uint32_t spi_getreg(struct max326_spidev_s *priv,
              unsigned int offset);
static void spi_putreg(struct max326_spidev_s *priv,
              unsigned int offset, uint32_t value);
#else
#  define spi_checkreg(priv,wr,regval,regaddr) (false)
static inline uint32_t spi_getreg(struct max326_spidev_s *priv,
              unsigned int offset);
static inline void spi_putreg(struct max326_spidev_s *priv,
              unsigned int offset, uint32_t value);
#endif

static void spi_modify_ctrl0(struct max326_spidev_s *priv, uint32_t setbits,
              uint32_t clrbits);
static void spi_modify_ctrl1(struct max326_spidev_s *priv, uint32_t setbits,
              uint32_t clrbits);
static void spi_modify_ctrl2(struct max326_spidev_s *priv, uint32_t setbits,
              uint32_t clrbits);
static void spi_modify_dma(struct max326_spidev_s *priv, uint32_t setbits,
              uint32_t clrbits);
#ifdef CONFIG_MAX326_SPI_INTERRUPTS
static void spi_modify_inten(struct max326_spidev_s *priv, uint32_t setbits,
              uint32_t clrbits)
#endif

