apache/nuttx/arch/arm/src/max326xx/max32660/max32660_spim.c
/* Interrupt support */

static int  spi_poll(struct max326_spidev_s *priv);
#ifdef CONFIG_MAX326_SPI_INTERRUPTS
static int  spi_interrupt(int irq, void *context, void *arg);
#endif

/* SPI methods */

static int  spi_lock(struct spi_dev_s *dev, bool lock);
#ifdef CONFIG_MAX326XX_SPIM0
static void spi0_select(struct spi_dev_s *dev, uint32_t devid,
              bool selected);
#endif
static uint32_t spi_setfrequency(struct spi_dev_s *dev,
              uint32_t frequency);
static void spi_setmode(struct spi_dev_s *dev, enum spi_mode_e mode);
static void spi_setbits(struct spi_dev_s *dev, int nbits);
#ifdef CONFIG_SPI_HWFEATURES
static int  spi_hwfeatures(struct spi_dev_s *dev,
              spi_hwfeatures_t features);
#endif
static uint32_t spi_send(struct spi_dev_s *dev, uint32_t wd);
static void spi_exchange(struct spi_dev_s *dev, const void *txbuffer,
              void *rxbuffer, size_t nwords);
#ifndef CONFIG_SPI_EXCHANGE
static void spi_sndblock(struct spi_dev_s *dev, const void *txbuffer,
              size_t nwords);
static void spi_recvblock(struct spi_dev_s *dev, void *rxbuffer,
              size_t nwords);
#endif

/* Initialization */

static void spi_bus_initialize(struct max326_spidev_s *priv);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* NOTE:  This is somewhat over-designed since there is only a single SPI
 * peripheral.  However, it supports simple group to additional SPI
 * peripherals by extending this logic.
 */

#ifdef CONFIG_MAX326XX_SPIM0
static const struct spi_ops_s g_sp0iops =
{
  .lock              = spi_lock,
  .select            = spi0_select,
  .setfrequency      = spi_setfrequency,
  .setmode           = spi_setmode,
  .setbits           = spi_setbits,
#ifdef CONFIG_SPI_HWFEATURES
  .hwfeatures        = spi_hwfeatures,
#endif
  .status            = max326_spi0status,
#ifdef CONFIG_SPI_CMDDATA
  .cmddata           = max326_spi0cmddata,
#endif
  .send              = spi_send,
#ifdef CONFIG_SPI_EXCHANGE
  .exchange          = spi_exchange,
#else
  .sndblock          = spi_sndblock,
  .recvblock         = spi_recvblock,
#endif
#ifdef CONFIG_SPI_CALLBACK
  .registercallback  = max326_spi0register,  /* Provided externally */
#else
  .registercallback  = 0,                   /* Not implemented */
#endif
};

static struct max326_spidev_s g_spi0dev =
{
  .dev      =
  {
    .ops    = &g_sp0iops,
  },
  .base     = MAX326_SPI0_BASE,
  .lock     = NXMUTEX_INITIALIZER,
#ifdef CONFIG_MAX326_SPI_INTERRUPTS
  .irq      = MAX326_IRQ_SPI,
#endif
#ifdef CONFIG_MAX326XX_3WIRE
  .wire3    = true,
#endif
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

#ifdef CONFIG_MAX326_SPI_REGDEBUG
static bool spi_checkreg(struct max326_spidev_s *priv, bool wr,
                         uint32_t regval, uintptr_t regaddr)
{
  if (wr      == priv->wrlast &&     /* Same kind of access? */
      regval  == priv->vallast &&    /* Same value? */
      regaddr == priv->addrlast)     /* Same address? */
    {
      /* Yes, then just keep a count of the number of times we did this. */

      priv->ntimes++;
      return false;
    }
  else
    {
      /* Did we do the previous operation more than once? */

      if (priv->ntimes > 0)
        {
          /* Yes... show how many times we did it */

          mcinfo("...[Repeats %d times]...\n", priv->ntimes);
        }

      /* Save information about the new access */

      priv->wrlast   = wr;
      priv->vallast  = regval;
      priv->addrlast = regaddr;
      priv->ntimes   = 0;
    }

  /* Return true if this is the first time that we have done this operation */

  return true;
}
#endif

/****************************************************************************
 * Name: spi_getreg
 *
 * Description:
 *   Get the contents of the SPI register at offset
 *
 * Input Parameters:
 *   priv   - private SPI device structure
 *   offset - offset to the register of interest
 *
 * Returned Value:
 *   The contents of the 32-bit register
 *
 ****************************************************************************/

#ifdef CONFIG_MAX326_SPI_REGDEBUG
static uint32_t spi_getreg(struct max326_spidev_s *priv, unsigned int offset)
{
  uintptr_t regaddr = priv->base + offset;
  uint32_t regval   = getreg32(regaddr);

  if (spi_checkreg(priv, false, regval, regaddr))
    {
      mcinfo("%08x->%08x\n", regaddr, regval);
    }

  return regval;
}
#else
static inline uint32_t spi_getreg(struct max326_spidev_s *priv,
                                  unsigned int offset)
{
  return getreg32(priv->base + offset);
}
#endif

/****************************************************************************
 * Name: spi_putreg
 *
 * Description:
 *   Write a 16-bit value to the SPI register at offset
 *
 * Input Parameters:
 *   priv   - Private SPI device structure
 *   offset - offset to the register of interest
 *   regval - the 32-bit value to be written
 *
 * Returned Value:
 *   The contents of the 16-bit register
 *
 ****************************************************************************/

#ifdef CONFIG_MAX326_SPI_REGDEBUG
static void spi_putreg(struct max326_spidev_s *priv, unsigned int offset,
                       uint32_t regval)
{
  uintptr_t regaddr = priv->base + offset;

  if (spi_checkreg(priv, true, regval, regaddr))
    {
      mcinfo("%08x<-%08x\n", regaddr, regval);
    }

  putreg32(regval, regaddr);
}
#else
static inline void spi_putreg(struct max326_spidev_s *priv,
                              unsigned int offset, uint32_t regval)
{
  putreg32(regval, priv->base + offset);
}
#endif

/****************************************************************************
 * Name: spi_modify_ctrl0
 *
 * Description:
 *   Clear and set bits in the CTRL0 register
 *
 * Input Parameters:
 *   priv    - Device-specific state data
 *   clrbits - The bits to clear
 *   setbits - The bits to set
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void spi_modify_ctrl0(struct max326_spidev_s *priv, uint32_t setbits,
                             uint32_t clrbits)
{
  uint32_t ctrl0;

  ctrl0  = spi_getreg(priv, MAX326_SPI_CTRL0_OFFSET);
  ctrl0 &= ~clrbits;
  ctrl0 |= setbits;
  spi_putreg(priv, MAX326_SPI_CTRL0_OFFSET, ctrl0);
}

/****************************************************************************
 * Name: spi_modify_ctrl1
 *
 * Description:
 *   Clear and set bits in the CTRL1 register
 *
 * Input Parameters:
 *   priv    - Device-specific state data
 *   clrbits - The bits to clear
 *   setbits - The bits to set
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void spi_modify_ctrl1(struct max326_spidev_s *priv, uint32_t setbits,
                             uint32_t clrbits)
{
  uint32_t ctrl1;

  ctrl1  = spi_getreg(priv, MAX326_SPI_CTRL1_OFFSET);
  ctrl1 &= ~clrbits;
  ctrl1 |= setbits;
  spi_putreg(priv, MAX326_SPI_CTRL1_OFFSET, ctrl1);
}

/****************************************************************************
 * Name: spi_modify_ctrl2
 *
 * Description:
 *   Clear and set bits in the CTRL1 register
 *
 * Input Parameters:
 *   priv    - Device-specific state data
 *   clrbits - The bits to clear
 *   setbits - The bits to set
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void spi_modify_ctrl2(struct max326_spidev_s *priv, uint32_t setbits,
                             uint32_t clrbits)
{
  uint32_t ctrl2;

  ctrl2  = spi_getreg(priv, MAX326_SPI_CTRL2_OFFSET);
  ctrl2 &= ~clrbits;
  ctrl2 |= setbits;
  spi_putreg(priv, MAX326_SPI_CTRL2_OFFSET, ctrl2);
}

/****************************************************************************
 * Name: spi_modify_dma
 *
 * Description:
 *   Clear and set bits in the DMA register
 *
 * Input Parameters:
 *   priv    - Device-specific state data
 *   clrbits - The bits to clear
 *   setbits - The bits to set
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void spi_modify_dma(struct max326_spidev_s *priv, uint32_t setbits,
                           uint32_t clrbits)
{
  uint32_t dma;

