apache/nuttx/arch/arm/src/max326xx/max32660/max32660_spim.c
  dma  = spi_getreg(priv, MAX326_SPI_DMA_OFFSET);
  dma &= ~clrbits;
  dma |= setbits;
  spi_putreg(priv, MAX326_SPI_DMA_OFFSET, dma);
}

/****************************************************************************
 * Name: spi_modify_inten
 *
 * Description:
 *   Clear and set bits in the INTEN register
 *
 * Input Parameters:
 *   priv    - Device-specific state data
 *   clrbits - The bits to clear
 *   setbits - The bits to set
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_MAX326_SPI_INTERRUPTS
static void spi_modify_inten(struct max326_spidev_s *priv, uint32_t setbits,
                             uint32_t clrbits)
{
  uint32_t inten;

  inten  = spi_getreg(priv, MAX326_SPI_INTEN_OFFSET);
  inten &= ~clrbits;
  inten |= setbits;
  spi_putreg(priv, MAX326_SPI_INTEN_OFFSET, inten);
}
#endif

/****************************************************************************
 * Name: spi_poll
 *
 * Description:
 *   Handle SPI events.  This may be called repeatedly in polled mode or may
 *   be called from spi_interrupt() in interrupt mode.
 *
 * Returned Value:
 *   Returns OK when the transfer is complete, -EBUSY is the transfer is
 *   still in progress.  Could also return other negated errno values if
 *   an error is detected.
 *
 ****************************************************************************/

static int spi_poll(struct max326_spidev_s *priv)
{
  const uint8_t *src;
  uint8_t *dest;
  uint32_t inten;
  uint32_t length;
  uint32_t regval;
  uint32_t tmp;
  int txavail;
  int rxavail;
  int remaining;

  /* Get the transfer size in units of bytes */

  length = priv->data16 ? priv->xfrlen << 1 : priv->xfrlen;

  /* Is there a Tx source buffer? */

  inten = 0;
  if (priv->txbuffer != NULL)
    {
      /* Need to know when all bytes are transmitted. */

      inten |= SPI_INT_TXEMPTY;

      /* Calculate how many bytes we can write to the FIFO */

      regval  = spi_getreg(priv, MAX326_SPI_DMA_OFFSET);
      tmp     = (regval & SPI_DMA_TXFIFOCNT_MASK) >> SPI_DMA_TXFIFOCNT_SHIFT;
      txavail =  MAX326_SPI_FIFO_DEPTH - tmp;

      if ((length - priv->txbytes) < txavail)
        {
          txavail = (length - priv->txbytes);
        }

      if (priv->data16)
        {
          txavail &= ~1;
        }

      /* Write Tx buffer data to the Tx FIFO */

      src = &((const uint8_t *)priv->txbuffer)[priv->txbytes];
      while (txavail > 0)
        {
          dest = (uint8_t *)(priv->base + MAX326_SPI_DATA_OFFSET);

          if (txavail > 3)
            {
              *dest++        = *src++;
              *dest++        = *src++;
              *dest++        = *src++;
              *dest          = *src++;

              txavail       -= 4;
              priv->txbytes += 4;
            }
          else if (txavail > 1)
            {
              *dest++        = *src++;
              *dest          = *src++;

              txavail       -= 2;
              priv->txbytes += 2;
            }
          else if (!priv->data16)
            {
              *dest          = *src++;

              txavail       -= 1;
              priv->txbytes += 1;
            }
        }
    }

  remaining = length - priv->txbytes;

  /* Set the TX interrupts */

  if (remaining > 0)
    {
      if (remaining > MAX326_SPI_FIFO_DEPTH)
        {
          /* Set the TX FIFO almost empty interrupt if we have to refill */

          regval = SPI_DMA_TXFIFOLVL(MAX326_SPI_FIFO_DEPTH);
        }
      else
        {
          regval = SPI_DMA_TXFIFOLVL(remaining);
        }

      spi_modify_dma(priv, regval, SPI_DMA_TXFIFOLVL_MASK);
      inten |= SPI_INT_TXLEVEL;
    }

  /* Break out if we've transmitted all the bytes and not receiving */

  if ((priv->rxbuffer == NULL) && priv->txbytes == length &&
      (spi_getreg(priv, MAX326_SPI_DMA_OFFSET) &
       SPI_DMA_TXFIFOCNT_MASK) == 0)
    {
      goto done;
    }

  /* Read from the RX FIFO */

  if (priv->rxbuffer != NULL)
    {
      /* Wait for there to be data in the RX FIFO */

      regval  = spi_getreg(priv, MAX326_SPI_DMA_OFFSET);
      rxavail = (regval & SPI_DMA_RXFIFOCNT_MASK) >> SPI_DMA_RXFIFOCNT_SHIFT;

      if (length - priv->rxbytes < rxavail)
        {
          rxavail = length - priv->rxbytes;
        }

      dest = &((uint8_t *)priv->rxbuffer)[priv->rxbytes];
      if (!priv->data16 || rxavail >= sizeof(uint16_t))
        {
          /* Read data from the Rx FIFO */

          src = (const uint8_t *)(priv->base + MAX326_SPI_DATA_OFFSET);
          while (rxavail > 0)
            {
              if (rxavail > 3)
                {
                  *dest++        = *src++;
                  *dest++        = *src++;
                  *dest++        = *src++;
                  *dest++        = *src;

                  rxavail       -= 4;
                  priv->rxbytes += 4;
                }
              else if (rxavail > 1)
                {
                  *dest++        = *src++;
                  *dest++        = *src;

                  rxavail       -= 2;
                  priv->rxbytes += 2;
                }
              else
                {
                  *dest++        = *src;

                  rxavail       -= 1;
                  priv->rxbytes += 1;
                }

              /* Don't read less than 2 bytes if we are using 16-bit data
               * transfers.
               */

              if (rxavail < sizeof(uint16_t) && priv->data16)
                {
                  break;
                }
            }
        }

      remaining = length - priv->rxbytes;
      if (remaining > 0)
        {
          if (remaining > MAX326_SPI_FIFO_DEPTH)
            {
              regval = SPI_DMA_RXFIFOLVL(2);
            }
          else
            {
              regval = SPI_DMA_RXFIFOLVL(remaining - 1);
            }

          spi_modify_dma(priv, regval, SPI_DMA_RXFIFOLVL_MASK);
          inten |= SPI_INT_RXLEVEL;
        }

      /* Break out if we've received all the bytes and we're not
       * transmitting.
       */

      if (priv->txbuffer == NULL && priv->rxbytes == length)
        {
          goto done;
        }
    }

  /* Break out once we've transmitted and received all of the data. */

