apache/nuttx/arch/arm/src/max326xx/max32660/max32660_spim.c
  if (priv->rxbytes == length && priv->txbytes == length)
    {
      regval = spi_getreg(priv, MAX326_SPI_DMA_OFFSET);
      if ((regval & SPI_DMA_TXFIFOCNT_MASK) == 0)
        {
          goto done;
        }
    }

#ifdef CONFIG_MAX326_SPI_INTERRUPTS
  /* Enable interrupts for the next phase */

  spi_putreg(priv, MAX326_SPI_INTEN_OFFSET, inten);
#endif

  /* Return busy to indicate that we are not finished with the transfer */

  return -EBUSY;

done:
#ifdef CONFIG_MAX326_SPI_INTERRUPTS
  /* We are done.. disable interrupts */

  spi_putreg(priv, MAX326_SPI_INTEN_OFFSET, 0);
#endif

  /* Return OK to indicate that we are finished with the transfer */

  return OK;
}

/****************************************************************************
 * Name: spi_interrupt
 *
 * Description:
 *   This is the SPI interrupt handler.  It will be invoked when an
 *   interrupt received on the 'irq'.
 *
 ****************************************************************************/

#ifdef CONFIG_MAX326_SPI_INTERRUPTS
static int spi_interrupt(int irq, void *context, void *arg)
{
  struct max326_spidev_s *priv = (struct max326_spidev_s *)arg;
  uint32_t intfl;
  uint32_t regval;
  unsigned int rxavail;
  unsigned int rxlevel;
  int ret;

  /* Read pending interrupt flags, interrupt enables, and SPI status
   * registers.
   */

  intfl = spi_getreg(priv, MAX326_SPI_INTFL_OFFSET);

  /* Disable all interrupts */

  spi_putreg(priv, MAX326_SPI_INTEN_OFFSET, 0);

  /* Clear pending interrupt flags */

  max326_serialout(priv, MAX326_SPI_INTFL_OFFSET, intfl & SPI_INT_ALL);

  /* Handle any active request */

  if (intfl != 0)
    {
      do
        {
          ret = spi_poll(priv);
          DEBUGASSERT(ret == OK || ret == -EBUSY);

          /* Check if there is more Rx data to be read */

          regval  = spi_getreg(priv, MAX326_SPI_DMA_OFFSET);
          rxavail = (regval & SPI_DMA_TXFIFOCNT_MASK) >>
                     SPI_DMA_TXFIFOCNT_SHIFT;
          rxlevel = (regval & SPI_DMA_RXFIFOLVL_MASK) >>
                     SPI_DMA_RXFIFOLVL_SHIFT;
        }
      while (/* RX buffer != NULL && */ rxavail > rxlevel);
    }

  return OK;
}
#endif

/****************************************************************************
 * Name: spi_lock
 *
 * Description:
 *   On SPI buses where there are multiple devices, it will be necessary to
 *   lock SPI to have exclusive access to the buses for a sequence of
 *   transfers.  The bus should be locked before the chip is selected. After
 *   locking the SPI bus, the caller should then also call the setfrequency,
 *   setbits, and setmode methods to make sure that the SPI is properly
 *   configured for the device.  If the SPI bus is being shared, then it
 *   may have been left in an incompatible state.
 *
 * Input Parameters:
 *   dev  - Device-specific state data
 *   lock - true: Lock spi bus, false: unlock SPI bus
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static int spi_lock(struct spi_dev_s *dev, bool lock)
{
  struct max326_spidev_s *priv = (struct max326_spidev_s *)dev;
  int ret;

  if (lock)
    {
      ret = nxmutex_lock(&priv->lock);
    }
  else
    {
      ret = nxmutex_unlock(&priv->lock);
    }

  return ret;
}

/****************************************************************************
 * Name: SPI_SELECT
 *
 * Description:
 *   Enable/disable the SPI chip select.   The implementation of this method
 *   must include handshaking:  If a device is selected, it must hold off
 *   all other attempts to select the device until the device is deselected.
 *   Required.
 *
 * Input Parameters:
 *   dev -      Device-specific state data
 *   devid -    Identifies the device to select
 *   selected - true: slave selected, false: slave de-selected
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_MAX326XX_SPIM0
static void spi0_select(struct spi_dev_s *dev, uint32_t devid, bool selected)
{
  struct max326_spidev_s *priv;

  /* Forward the call to the board-specific implementation */

  DEBUGASSERT(dev != NULL);
  max326_spi0select(dev, devid, selected);

  /* The hardware requires that the SPI block be disabled and re-enabled at
   * end of each transaction to cancel the on ongoing transaction (while
   * chip select is inactive).
   */

  if (!selected)
    {
      priv = (struct max326_spidev_s *)dev;
      spi_modify_ctrl0(priv, 0, SPI_CTRL0_SPIEN);
    }
}
#endif

/****************************************************************************
 * Name: spi_setfrequency
 *
 * Description:
 *   Set the SPI frequency.
 *
 * Input Parameters:
 *   dev -       Device-specific state data
 *   frequency - The SPI frequency requested
 *
 * Returned Value:
 *   Returns the actual frequency selected
 *
 ****************************************************************************/

static uint32_t spi_setfrequency(struct spi_dev_s *dev, uint32_t frequency)
{
  struct max326_spidev_s *priv = (struct max326_spidev_s *)dev;

  /* Has the frequency changed? */

  if (frequency != priv->frequency)
    {
      uint32_t pclk;
      uint32_t tmpbaud;
      uint32_t actual;
      uint32_t error;
      uint32_t regval;
      unsigned int tmpscale;
      unsigned int tmphigh;
      unsigned int scale;
      unsigned int high;

      /* The SPI clock derives from the PCLK:
       *
       *   Fspi = Fpclk / (1 << CLKCFG.scale)
       *
       * The SPI high time is determined by Tspi and CLKCFG.high:
       *
       *   Thi = Tspi * CLKCFG.high
       *
       * Similar the SPI low time id determined by Tspi and CLKCFG.low:
       *
       *   Tlow = Tspi * CLKCFG.low
       *
       * The BAUD is the given by:
       *
       *   Fbaud = 1 / (Thi + Tlow)
       *
       * If we assume that Thi == Tlow, then:
       *
       *   Thi   = Tspi * CLKCFG.high
       *   Fbaud = 1 / (2 * Thi)
       *
       * And
       *
       *   Fbaud       = Fpclk / CLKCFG.high / (1 << (CLKCFG.scale + 1)
       *   CLKCFG.high = Fpclk / (1 << (CLKCFG.scale + 1)) / Fbaud
       *
       * Example:  Fpclk = 48MHz, Fbaud=1MHz
       *
       *   scale  CLKCFG.high Resulting Fbaud
       *     0    24         1,000,0000 (exact)
       *     1    12         1,000,0000 (exact)
       *     2    6          1,000,0000 (exact)
       *     3    3          1,000,0000 (exact)
       *     4    1          1,500,0000
       *     5    0          Invalid
       *     6    0          Invalid
       *     7    0          Invalid
       *     8    0          Invalid
       *
       *   Fbaud / 2 = Fspi / CLKCFG.high
       *   Fbaud = 2 * Fspi / CLKCFG.high
       */

