apache/nuttx/arch/arm/src/max326xx/max32660/max32660_spim.c
  /* NOTE: The MAX326 slave select pin is not used.  It is controlled as a
   * GPIO output from the upper half driver.
   */

  /* Setup the Rx number of words to exchange */

  if (rxbuffer != NULL)
    {
      /* Note: If the SPI port is set to operate in 4-wire mode, the RXNUM
       * field is ignored and the TXNUM field is used for both the number
       * of words to receive or transmit.
       */

      if (priv->wire3)
        {
          spi_modify_ctrl1(priv, SPI_CTRL1_RXNUMCH(nwords),
                           SPI_CTRL1_RXNUMCH_MASK);
        }
       else
        {
          spi_modify_ctrl1(priv, SPI_CTRL1_TXNUMCH(nwords),
                           SPI_CTRL1_TXNUMCH_MASK);
        }

      /* Enable the DMA Rx FIFO */

      spi_modify_dma(priv, SPI_DMA_RXFIFOEN, 0);
    }
  else
    {
      /* No Rx data sink */

      spi_modify_ctrl1(priv, 0, SPI_CTRL1_RXNUMCH_MASK);
      spi_modify_dma(priv, 0, SPI_DMA_RXFIFOEN);
    }

  /* Four wire mode always operates in full duplex.  We must have some Tx
   * buffer available in all cases.
   */

  if (!priv->wire3 && txbuffer == NULL)
    {
      size_t nbytes = priv->data16 ? nwords << 1 : nwords;

      /* We will dual-purpose the Rx buffer, initialized to zero */

      memset(priv->rxbuffer, 0, nbytes);
      priv->txbuffer = priv->rxbuffer;
    }

  /* Set up the number of Tx words to exchange */

  if (priv->txbuffer != NULL)
    {
      spi_modify_ctrl1(priv, SPI_CTRL1_TXNUMCH(nwords),
                       SPI_CTRL1_TXNUMCH_MASK);

      /* Enable the DMA Tx FIFO */

      spi_modify_dma(priv, SPI_DMA_TXFIFOEN, 0);
    }
  else
    {
      /* No Tx data source */

      spi_modify_dma(priv, 0, SPI_DMA_TXFIFOEN);
    }

  /* Flush the Rx and Tx FIFOs */

  spi_modify_dma(priv, SPI_DMA_TXFIFOCLR | SPI_DMA_RXFIFOCLR, 0);

  /* Clear pending interrupts */

  regval = spi_getreg(priv, MAX326_SPI_INTFL_OFFSET);
  spi_putreg(priv, MAX326_SPI_INTFL_OFFSET, regval);

  /* Re-enable SPI to start the next transfer */

  spi_modify_ctrl0(priv, SPI_CTRL0_SPIEN, 0);

  /* Poll one time to setup the transfer */

  ret = spi_poll(priv);
  DEBUGASSERT(ret == OK || ret == -EBUSY);

  /* Initiate data transmission */

  spi_modify_ctrl0(priv, SPI_CTRL0_START, 0);
  priv->busy = true;

#ifndef CONFIG_MAX326_SPI_INTERRUPTS
  /* Poll repeatedly until the transfer is complete */

  do
    {
      ret = spi_poll(priv);
    }
  while (ret != OK);

  /* Then wait for the master done interrupt */

  do
    {
      regval = spi_getreg(priv, MAX326_SPI_INTFL_OFFSET);
    }
  while ((regval & SPI_INT_MDONE) == 0);
#endif
}

/****************************************************************************
 * Name: spi_sndblock
 *
 * Description:
 *   Send a block of data on SPI
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *   txbuffer - A pointer to the buffer of data to be sent
 *   nwords   - the length of data to send from the buffer in number of
 *              words.  The wordsize is determined by the number of
 *              bits-per-word selected for the SPI interface.  If nbits <= 8,
 *              the data is packed into uint8_t's; if nbits >8, the data is
 *              packed into uint16_t's
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifndef CONFIG_SPI_EXCHANGE
static void spi_sndblock(struct spi_dev_s *dev, const void *txbuffer,
                         size_t nwords)
{
  spiinfo("txbuffer=%p nwords=%d\n", txbuffer, nwords);
  spi_exchange(dev, txbuffer, NULL, nwords);
}
#endif

/****************************************************************************
 * Name: spi_recvblock
 *
 * Description:
 *   Receive a block of data from SPI
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *   rxbuffer - A pointer to the buffer in which to receive data
 *   nwords   - the length of data that can be received in the buffer in
 *              number of words.  The wordsize is determined by the number of
 *              bits-per-word selected for the SPI interface.  If nbits <= 8,
 *              the data is packed into uint8_t's; if nbits >8, the data is
 *              packed into uint16_t's
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifndef CONFIG_SPI_EXCHANGE
static void spi_recvblock(struct spi_dev_s *dev, void *rxbuffer,
                          size_t nwords)
{
  spiinfo("rxbuffer=%p nwords=%d\n", rxbuffer, nwords);
  spi_exchange(dev, NULL, rxbuffer, nwords);
}
#endif

/****************************************************************************
 * Name: spi_bus_initialize
 *
 * Description:
 *   Initialize the selected SPI bus in its default state (Master, 8-bit,
 *   mode 0, etc.)
 *
 * Input Parameters:
 *   priv   - private SPI device structure
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void spi_bus_initialize(struct max326_spidev_s *priv)
{
  uint32_t setbits;
  uint32_t clrbits;
  uint32_t regval;

  /* Enable SPI */

  spi_modify_ctrl0(priv, SPI_CTRL0_SPIEN, 0);

  /* Setup slaved select timing (even in Master mode?) */

  regval = (SPI_SSTIME_SSACT1(1) | SPI_SSTIME_SSACT2(1) |
            SPI_SSTIME_SSINACT(1));
  spi_putreg(priv, MAX326_SPI_SSTIME_OFFSET, regval);

  /* Configure CTRL0. Default configuration:
   *   Mode 0:                        CTRL2: CLKPHA=0 and CLKPOL=0
   *   8-bit:                         CTRL2: NUMBITS=8
   */

  clrbits = SPI_CTRL2_CLKPHA | SPI_CTRL2_CLKPOL | SPI_CTRL2_NUMBITS_MASK;
  setbits = SPI_CTRL2_NUMBITS(8);
  spi_modify_ctrl2(priv, setbits, clrbits);

  priv->frequency = 0;
  priv->nbits     = 8;
  priv->mode      = SPIDEV_MODE0;

  /* Enable Master mode */

  spi_modify_ctrl0(priv, SPI_CTRL0_MMEN, 0);

  /* Select a default frequency of approx. 400KHz */

  spi_setfrequency((struct spi_dev_s *)priv, 400000);

  /* Set up 3- or 4-pin mode */

