apache/nuttx/arch/arm/src/max326xx/max32660/max32660_spim.c
  regval = priv->wire3 ? SPI_CTRL2_DATWIDTH_SINGLE : SPI_CTRL2_DATWIDTH_DUAL;
  spi_modify_ctrl2(priv, regval, SPI_CTRL2_DATWIDTH_MASK);

  /* Disable all interrupts at the peripheral */

  spi_putreg(priv, MAX326_SPI_INTEN_OFFSET, 0);

  /* Clear pending interrupts */

  regval = spi_getreg(priv, MAX326_SPI_INTFL_OFFSET);
  spi_putreg(priv, MAX326_SPI_INTFL_OFFSET, regval);

#ifdef CONFIG_MAX326_SPI_INTERRUPTS
  /* Attach the interrupt handler and enable the IRQ at the NVIC.
   * Interrupts are (probably) still disabled at the SPI peripheral.
   */

  ret = irq_attach(priv->irq, spi_interrupt, priv);
  if (ret == OK)
    {
      up_enable_irq(priv->irq);
    }
#endif
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: max326_spibus_initialize
 *
 * Description:
 *   Initialize the selected SPI bus
 *
 * Input Parameters:
 *   Port number (for hardware that has multiple SPI interfaces)
 *
 * Returned Value:
 *   Valid SPI device structure reference on success; a NULL on failure
 *
 ****************************************************************************/

struct spi_dev_s *max326_spibus_initialize(int bus)
{
  struct max326_spidev_s *priv = NULL;

  irqstate_t flags = enter_critical_section();

#ifdef CONFIG_MAX326XX_SPIM0
  if (bus == 0)
    {
      /* Select SPI0 */

      priv = &g_spi0dev;

      /* Only configure if the bus is not already configured */

      if (!priv->initialized)
        {
          /* Enable peripheral clocking */

          max326_spi0_enableclk();

          /* Configure SPI0 pins: SCK, MISO, and MOSI */

          max326_gpio_config(GPIO_SPI0_SCK);
          max326_gpio_config(GPIO_SPI0_MISO);
          max326_gpio_config(GPIO_SPI0_MOSI);

          /* Set up default configuration: Master, 8-bit, etc. */

          spi_bus_initialize(priv);
          priv->initialized = true;
        }
    }
  else
#endif
    {
      spierr("ERROR: Unsupported SPI bus: %d\n", bus);
    }

  leave_critical_section(flags);
  return (struct spi_dev_s *)priv;
}

#endif /* CONFIG_MAX326XX_HAVE_SPIM */
